# Pandas

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 1

In [2]:
s1 = Series([1, 2, 3], index=['A', 'B', 'C'])
s1

A    1
B    2
C    3
dtype: int64

In [3]:
s2 = Series([4, 5, 6, 7], index=['B', 'C', 'D', 'E'])
s2

B    4
C    5
D    6
E    7
dtype: int64

In [4]:
s1 + s2

A    NaN
B    6.0
C    8.0
D    NaN
E    NaN
dtype: float64

In [5]:
s1 - s2

A    NaN
B   -2.0
C   -2.0
D    NaN
E    NaN
dtype: float64

### 2

In [7]:
df1 = DataFrame(np.arange(4).reshape(2, 2), index=['A', 'B'], columns=['BJ', 'SH'])
df1

   BJ  SH
A   0   1
B   2   3

In [8]:
df2 = DataFrame(np.arange(9).reshape(3, 3), index=['A', 'B', 'C'], columns=['BJ', 'SH', 'GZ'])
df2

   BJ  SH  GZ
A   0   1   2
B   3   4   5
C   6   7   8

In [9]:
df1 + df2

    BJ  GZ   SH
A  0.0 NaN  2.0
B  5.0 NaN  7.0
C  NaN NaN  NaN

In [10]:
df1 - df2

    BJ  GZ   SH
A  0.0 NaN  0.0
B -1.0 NaN -1.0
C  NaN NaN  NaN

### 3

In [11]:
df3 = DataFrame([[1, 2, 3], [4, 5, np.nan], [7, 8, 9]], index=['r1', 'r2', 'r3'], columns=['c1', 'c2', 'c3'])
df3

    c1  c2   c3
r1   1   2  3.0
r2   4   5  NaN
r3   7   8  9.0

In [12]:
# 按列求和，忽略 NaN
df3.sum()

c1    12.0
c2    15.0
c3    12.0
dtype: float64

In [13]:
type(df3.sum())

pandas.core.series.Series

In [14]:
df3.sum(axis=0)

c1    12.0
c2    15.0
c3    12.0
dtype: float64

In [15]:
# 按行求和，忽略 NaN
df3.sum(axis=1)

r1     6.0
r2     9.0
r3    24.0
dtype: float64

### 4

In [16]:
df3

    c1  c2   c3
r1   1   2  3.0
r2   4   5  NaN
r3   7   8  9.0

In [17]:
df3.min()

c1    1.0
c2    2.0
c3    3.0
dtype: float64

In [18]:
df3.min(axis=1)

r1    1.0
r2    4.0
r3    7.0
dtype: float64

### 5

In [19]:
df3

    c1  c2   c3
r1   1   2  3.0
r2   4   5  NaN
r3   7   8  9.0

In [20]:
df3.max()

c1    7.0
c2    8.0
c3    9.0
dtype: float64

In [21]:
df3.max(axis=1)

r1    3.0
r2    5.0
r3    9.0
dtype: float64

### 6

In [22]:
df3

    c1  c2   c3
r1   1   2  3.0
r2   4   5  NaN
r3   7   8  9.0

In [23]:
df3.describe()

        c1   c2        c3
count  3.0  3.0  2.000000
mean   4.0  5.0  6.000000
std    3.0  3.0  4.242641
min    1.0  2.0  3.000000
25%    2.5  3.5  4.500000
50%    4.0  5.0  6.000000
75%    5.5  6.5  7.500000
max    7.0  8.0  9.000000